*&---------------------------------------------------------------------*
*& Include          ZBRSD0050_I01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0100 INPUT.
CASE OK_CODE.
  WHEN 'BACK' OR 'EXIT'.
    LEAVE TO SCREEN 0.
  WHEN 'CANCEL'.
    LEAVE PROGRAM.
  WHEN 'SAVE'.
    PERFORM CONFIRM_SAVE.
ENDCASE.
ENDMODULE.
*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0110  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0110 INPUT.
  CASE OK_CODE.
    WHEN 'OKAY'. " 팝업에서 저장버튼 눌렀을 때.
      PERFORM SAVE_BILLING.
      MESSAGE S106.

    WHEN 'CANCEL'. " 팝업에서 취소버튼 눌렀을 때.
      MESSAGE S105. " 대금청구 생성을 취소하였습니다.
      LEAVE TO SCREEN 0.

  ENDCASE.
ENDMODULE.
